# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [7,13, 12,24, 17,44]  
  - [26,31, 26,69, 44,56]  
  - [42,112, 76,97, 67,187]
  - [132,166, 111,311, 230,329]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[ -1, 1, Conv, [ 64, 6, 2, 2 ] ],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, TripletAttention, [128]],
   [-1, 1, Conv, [512, 3, 2]],  # 6-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, TripletAttention, [256]],
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P5/32
   [-1, 3, C3, [1024]],  # 10
   [ -1, 1, SPPF, [ 1024, 5 ] ],  # 11
   [-1, 1, TripletAttention, [512]], # 12
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]], 
   [-1, 3, C3, [512, False]],  # 16

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  
   [-1, 3, C3, [256, False]],  # 20 (P3/8-small)

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # 
   [-1, 1, C3, [128, False]],  # 24 
   [-1, 1, TripletAttention, [64]], # 25 

   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 21], 1, Concat, [1]],  # 
   [-1, 3, C3, [256, False]],  # 28
   [-1, 1, TripletAttention, [128]], # 29

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 17], 1, Concat, [1]],  # 
   [-1, 3, C3, [512, False]],  # 32
   [-1, 1, TripletAttention, [256]], # 33

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 13], 1, Concat, [1]],  
   [-1, 3, C3, [1024, False]],  # 36 
   [-1, 1, TripletAttention, [512]], # 37 

   [[25, 29, 33, 37], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
